tap "homebrew/bundle"
brew "go"
brew "neovim"
brew "pnpm"
brew "spaceship"
brew "tmux"
cask "arc"
cask "rectangle"
cask "slack"
cask "warp"
cask "notion"
cask "obs"
cask "obsidian"
cask "figma"
brew "eza"
brew "fzf"
brew "zoxide"
brew "ripgrep"
brew "bat"
cask "wezterm"
cask "raycast"
cask "font-maple-mono-nf"
cask "claude-code"
