tap "homebrew/bundle"
tap "oven-sh/bun"

# CLI tools
brew "bat"
brew "colima"
brew "coreutils"
brew "direnv"
brew "docker"
brew "docker-buildx"
brew "eza"
brew "fd"
brew "fzf"
brew "gh"
brew "git"
brew "go"
brew "jq"
brew "lnav"
brew "lua-language-server"
brew "neovim"
brew "opencode"
brew "oven-sh/bun/bun"
brew "parallel"
brew "pnpm"
brew "ripgrep"
brew "spaceship"
brew "sqlc"
brew "tlrc"
brew "tmux"
brew "uv"
brew "wget"
brew "zoxide"

# Apps
cask "arc"
cask "claude-code"
cask "codex"
cask "discord"
cask "figma"
cask "iterm2"
cask "notion"
cask "obs"
cask "obsidian"
cask "raycast"
cask "rectangle"
cask "slack"
cask "spotify"
cask "visual-studio-code"
cask "warp"
cask "wezterm"

# Fonts
cask "font-caskaydia-cove-nerd-font"
cask "font-hack-nerd-font"
cask "font-iosevka"
cask "font-maple-mono-nf"
